Revit 2027 API
BuiltInFailures.ViewSheetFailures.ViewOnASheetMustBeUniqueWarn Property
 Sheet views cannot contain more than one instance of "%1!s!."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewOnASheetMustBeUniqueWarn { get; }
Public Shared ReadOnly Property ViewOnASheetMustBeUniqueWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewOnASheetMustBeUniqueWarn {
	FailureDefinitionId^ get ();
}
static member ViewOnASheetMustBeUniqueWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewSheetFailures Class
Autodesk.Revit.DB Namespace